src/test/resources/artifacts/ESB/config/soapRequests/salesforce/esbQueryMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="wso2.connector.salesforce">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:loginUrl>%s(loginUrl)</urn:loginUrl>
        <urn:username>%s(username)</urn:username>
        <urn:password>%s(password)</urn:password>
        <urn:blocking>%s(blocking)</urn:blocking>
        <urn:method>query</urn:method>
        <urn:batchSize>%s(batchSize)</urn:batchSize>
        <urn:queryString>%s(queryString)</urn:queryString>
    </soapenv:Body>
</soapenv:Envelope>